<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Exception Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in Exceptions thrown throughout the system.
    | Regardless where it is placed, a button can be listed here so it is easily
    | found in a intuitive way.
    |
    */

    'backend' => [
        'access' => [
            'roles' => [
                'already_exists' => 'اسم الوظيفة موجود من قبل من فضلك أدخل اسم أخر.',
                'cant_delete_admin' => 'لا يمكنك حذف وظائف المدير.',
                'create_error' => 'عذرا. لا يمكن إضافة الوظيفة .من فضلك حاول مرة أخرى.',
                'delete_error' => 'عذرا. لا يمكن حذف الوظيفة .من فضلك حاول مرة أخرى.',
                'has_users' => 'عذرا. لا يمكن حذف وظيفة مربوطة بمستخدمين.',
                'needs_permission' => 'من فضلك اختر مستخدم على الأقل لهذه الوظيفة.',
                'not_found' => 'الوظيفة غير موجودة.',
                'update_error' => 'عذرا. لا يمكن تحديث الوظيفة .من فضلك حاول مرة أخرى.',
            ],

            'users' => [
                'already_confirmed' => 'تم تأكيد المستخدم بالفعل.',
                'cant_confirm' => 'يوجد مشكلة بتأكيد المستخدم.',
                'cant_deactivate_self' => 'لا يمكنك الاختيار لنفسك.',
                'cant_delete_admin' => 'لا يمكنك حذف مدير النظام.',
                'cant_delete_self' => 'لا يمكنك حذف حسابك.',
                'cant_delete_own_session' => 'لا يمكنك حذف جلستك.',
                'cant_restore' => 'هذا المستخدم لم يحذف بعد ولهذا لا يمكن استرجاعه.',
                'cant_unconfirm_admin' => 'لا يمكنك إلغاء تأكيد حساب مدير النظام.',
                'cant_unconfirm_self' => 'لا يمكنك إلغاء تأكيد حسابك.',
                'create_error' => 'عذرا. لا يمكن إضافة المستخدم.من فضلك حاول مرة أخرى.',
                'delete_error' => 'عذرا. لا يمكن حذف المستخدم.من فضلك حاول مرة أخرى.',
                'delete_first' => 'يجب حذف المستخدم  أولا لكي يتم حذف نهائيا من النظام.',
                'email_error' => 'البريد الالكتروني مستخدم بالفعل.',
                'mark_error' => 'عذرا. لا يمكن تحديث المستخدم.من فضلك حاول مرة أخرى.',
                'not_confirmed' => 'المستخدم لم يتم تأكيده بعد.',
                'not_found' => 'المستخدم غير موجود بالنظام.',
                'restore_error' => 'عذرا. لا يمكن استرجاع المستخدم.من فضلك حاول مرة أخرى.',
                'role_needed_create' => 'من فضلك اختر وظيفة على الأقل.',
                'role_needed' => 'من فضلك اختر وظيفة على الأقل.',
                'social_delete_error' => 'عذرا. لا يمكن حذف الحساب الاجتماعي للمستخدم ',
                'update_error' => 'عذرا. لا يمكن تحديث المستخدم.من فضلك حاول مرة أخرى.',
                'update_password_error' => 'عذرا. لا يمكن تغيير كلمة مرور المستخدم.من فضلك حاول مرة أخرى.',
            ],
        ],
    ],

    'frontend' => [
        'auth' => [
            'confirmation' => [
                'already_confirmed' => 'حسابك مؤكد بالفعل.',
                'confirm' => 'من فضلك أكد حسابك!',
                'created_confirm' => 'تم تأكيد حسابك وإرسال بريد الكتروني  من فضلك راجع بريدك الالكتروني للتأكيد.',
                'created_pending' => 'تم إنشاء حسابك وإرسال بريد الكتروني  من فضلك راجع بريدك الالكتروني للتأكيد.',
                'mismatch' => 'كود التفعيل غير متطابق.',
                'not_found' => 'كود التفعيل غير موجود.',
                'pending' => 'حسابك بانتظار التفعيل.',
                'resend' => 'حسابك غير مفعل بعد برجاء تفعيله من بريد الالكتروني أو <a href=":url">اضغط هنا </a> لارسال بريد الكتروني أخر.',
                'success' => 'تم تفعيل الحساب بنجاح!',
                'resent' => 'تم إرسال بريد الكتروني للتفعيل.',
            ],

            'deactivated' => 'تم تعطيل حسابك.',
            'email_taken' => 'البريد الالكتروني مستخدم بالفعل.',

            'password' => [
                'change_mismatch' => 'كلمة المرور المدخلة غير متطابقة مع القديمة.',
                'reset_problem' => 'حدثت مشكلة في إعادة تعيين كلمة المرور الخاصة بك. يرجى إعادة إرسال البريد الإلكتروني لإعادة تعيين كلمة المرور.',
            ],

            'registration_disabled' => 'التسجيل مغلق حاليا.',
        ],
    ],
    'duplicate_card_for_other_users' => 'تم تسجيل هذه البطاقة من قبل مستخدم آخر.',
    'duplicate_card_for_yourself' => 'تم تسجيل هذه البطاقة بنفسك.',
    'overlapped_with_other_request' => 'هناك مهمة أخرى قبلتها ولها وقت متداخل مع المهمة الحالية.',
];
